# FabricationSecSize Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ParameterTypeId..::..FabricationSecSize Property
ParameterTypeId Class See Also
---
"Size of Secondary End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationSecSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationSecSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationSecSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace